{
  "backend/main.mo": "Defines actor state and data types for posts, NFTs, chat, notifications, live events, profiles, and monetization, integrating authorization and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing VR‑related navigation removal changes and the files affected for three features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of various frontend components and pages in the project.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes with custom color tokens.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root app component handling authentication, profile setup, theming, and rendering MainLayout with global background.",
  "frontend/src/components/AppBackground.tsx": "Simple component rendering the global background wrapper and image.",
  "frontend/src/components/audio/AudioAssetPicker.tsx": "Displays a list of audio attachments, supports selecting and previewing audio, and provides UI states for loading and empty lists.",
  "frontend/src/components/avatar-closet/ClosetCategoryTabs.tsx": "Renders tab buttons for wardrobe categories and triggers category changes.",
  "frontend/src/components/avatar-closet/WardrobeItemCard.tsx": "Shows a selectable wardrobe item with a color preview and selection indicator.",
  "frontend/src/components/avatar-closet/WardrobeItemGrid.tsx": "Displays wardrobe items in a responsive grid and handles item selection.",
  "frontend/src/components/AvatarPreview.tsx": "SVG-based avatar renderer using config and equipped look to draw body, head, outfit, and accessories.",
  "frontend/src/components/BottomNav.tsx": "Five‑tab bottom navigation bar for pitch‑mode modules with icons and active tab highlighting, with VR removed.",
  "frontend/src/components/CreateButton.tsx": "Floating action button that opens different creation dialogs or sheets based on the active module.",
  "frontend/src/components/CreatePostDialog.tsx": "Modal for creating posts with text, optional image upload, and optional audio attachment.",
  "frontend/src/components/gaming/CreateVRSpaceDialog.tsx": "A deprecated VR space creation dialog that informs users to use the hub instead.",
  "frontend/src/components/gaming/EnterVRSpaceDialog.tsx": "Shows details for a VR world and provides a placeholder enter action with toast messaging.",
  "frontend/src/components/gaming/GameDetailPanel.tsx": "Displays detailed game info, images, and placeholder actions for play, preview, and VR.",
  "frontend/src/components/gaming/VRSpacesPlaceholder.tsx": "Presents a placeholder VR spaces list with sample entries and a coming‑soon notice.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing branding, notifications, and optional live events button.",
  "frontend/src/components/InvestorFlowStepper.tsx": "Bottom stepper that advances users through a predefined module flow sequence.",
  "frontend/src/components/MainLayout.tsx": "Primary app layout managing active module, view navigation, and routing to various feature pages.",
  "frontend/src/components/music/AudioUploadCard.tsx": "UI card for selecting, previewing, and uploading audio files with validation and backend mutation.",
  "frontend/src/components/music/ComposerPlaceholder.tsx": "Simple tone pad interface that plays sine-wave notes and a demo sequence using Web Audio API.",
  "frontend/src/components/music/CreateAudioSheet.tsx": "Bottom sheet that switches between audio composition, file upload, and a selection menu.",
  "frontend/src/components/nft/AirExperiencesToggleSection.tsx": "Three toggle cards letting users enable shoe NFT features across game, VR, and avatar contexts.",
  "frontend/src/components/nft/ClaimShoeNFTModal.tsx": "Multi‑step modal for selecting a shoe design and generating an NFT with simulated progress.",
  "frontend/src/components/nft/ListShoeNFTModal.tsx": "Three‑step modal for pricing and listing a shoe NFT on the marketplace with simulated listing logic.",
  "frontend/src/components/nft/NFTCard.tsx": "Clickable NFT preview card showing image, name, and rarity styling.",
  "frontend/src/components/nft/NFTDetailPanel.tsx": "Empty file or placeholder with no implemented content.",
  "frontend/src/components/NotificationsDrawer.tsx": "Slide-up drawer displaying a list of mock user notifications.",
  "frontend/src/components/PostCard.tsx": "Displays a social post with author info, content, optional media, audio playback, and basic actions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Forces initial profile setup by collecting username and bio and saving them via an API call.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, recreating it on identity change and invalidating dependent queries.",
  "frontend/src/hooks/useAvatarConfig.ts": "Manages avatar configuration state with load, save, revert, and unsaved-change detection using local storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities, handling login flow, and exposing identity state to components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks wrapping backend actor methods for user profiles, posts, audio attachments, and other data operations.",
  "frontend/src/index.css": "Global Tailwind styles defining theme variables, backgrounds, pitch mode visuals, and UI component styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/mock/accessoriesMarketplacePlaceholders.ts": "Provides mock accessory marketplace item types and placeholder data for various shoe-related accessories.",
  "frontend/src/mock/avatarClosetPlaceholders.ts": "Contains mock wardrobe items for shoes, accessories, and outfits with helpers to fetch items by category or ID.",
  "frontend/src/mock/gamingPortalPlaceholders.ts": "Defines game types, platforms, and a mock list of games with metadata for the gaming portal.",
  "frontend/src/mock/nftPortalPlaceholders.ts": "Defines an NFT placeholder interface, toggle flag, and sample NFT metadata used for the NFT portal.",
  "frontend/src/pages/AIRBrandCreatorSlotsPage.tsx": "UI page for managing creator slots, including creating, editing, deleting, and storing slot data via local storage.",
  "frontend/src/pages/AIRGameVRDetailPage.tsx": "Detail page for games or VR worlds with favorites, ratings, comments, and placeholder interaction actions.",
  "frontend/src/pages/AIRPlayAnywherePage.tsx": "Provides platform connection and launch simulation for games or VR worlds across multiple device types.",
  "frontend/src/pages/AIRspaceLiveEventsPage.tsx": "Fetches and lists active live events with join actions, loading states, and navigation controls.",
  "frontend/src/pages/AIRspaceMessagingPage.tsx": "Shows chat threads, friend requests, and notifications with actions to accept or reject requests.",
  "frontend/src/pages/AIRspaceMonetizationPage.tsx": "Loads creator monetization settings, allows toggling features and themes, and saves config updates.",
  "frontend/src/pages/AIRspacePage.tsx": "Displays the user's feed by fetching and sorting portfolio posts, with profile navigation.",
  "frontend/src/pages/AIRspaceProfilePage.tsx": "Renders a user profile with avatar, posts, NFTs, follow state, and related async media loading.",
  "frontend/src/pages/AIRVRSpaceCreationPage.tsx": "VR space builder page enabling scene editing, object placement, environment settings, and saving drafts.",
  "frontend/src/pages/AIRVRSpacesHubPage.tsx": "Displays a hub of mock and locally stored VR worlds, with category icons and navigation callbacks.",
  "frontend/src/pages/AvatarBuilderPage.tsx": "Provides UI for customizing avatar attributes such as skin tone, face, hair, and body, with live preview and save/revert actions.",
  "frontend/src/pages/AvatarClosetPage.tsx": "Manages equipping wardrobe items by category, showing a preview and allowing save of the selected look.",
  "frontend/src/pages/AvatarGamePreviewPage.tsx": "Previews the avatar in a game-like scene with equipped items and navigation to related pages.",
  "frontend/src/pages/AvatarGLBGeneratorPage.tsx": "Generates and downloads a futuristic anime-style avatar GLB file with status feedback.",
  "frontend/src/pages/AvatarSmartCubePreviewPage.tsx": "Displays the avatar in a SmartCube-style frame with stance selection and simulated sync capability.",
  "frontend/src/pages/GamingPage.tsx": "Renders a gaming portal with search, filtering, and navigation cards, using mock game data to display a filtered list.",
  "frontend/src/pages/LoginScreen.tsx": "Displays a login screen featuring branding, description, and a button that triggers Internet Identity authentication.",
  "frontend/src/pages/MusicModulePage.tsx": "Provides a music hub with sections for composing, uploading audio, and a placeholder marketplace.",
  "frontend/src/pages/NFTDropsPage.tsx": "Shows upcoming NFT drops with countdown timers, placeholder data, and UI for viewing release details.",
  "frontend/src/pages/NutechBrandCreatorDashboardPage.tsx": "Implements a brand dashboard for managing design projects, accessories, and OLED settings with multiple modals and forms.",
  "frontend/src/pages/NutechShoeAccessoriesMarketplacePage.tsx": "Implements an accessories marketplace page with search, filtering, item detail dialogs, and buy/sell/trade actions using placeholder data.",
  "frontend/src/pages/NutechShoeHealthTrackerPage.tsx": "Provides a shoe health dashboard with metrics, notifications, and forms to add or update shoe health data via query hooks.",
  "frontend/src/pages/NutechShoeNFTDetailPage.tsx": "Displays detailed NFT info and allows toggling AIR integration settings with optimistic updates and error handling.",
  "frontend/src/pages/NutechShoeNFTPortalPage.tsx": "Shows a portal for viewing, claiming, and navigating through NFT-related features, including NFT drops and detail pages.",
  "frontend/src/pages/NuTechXRWorldBuilderPage.tsx": "Loads A-Frame and displays an XR scene with an avatar, equipment assets, and diagnostic controls.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a profile dashboard with user data and navigation to various creator, designer, and NFT tools, plus logout handling.",
  "frontend/src/pages/ScanShoeToNFTPage.tsx": "UI page for scanning a shoe to generate a digital twin, including simulated scan animation and status handling.",
  "frontend/src/pages/ShoeDesignerPage.tsx": "Interactive shoe design page supporting file uploads, project creation, customization, and backend sync.",
  "frontend/src/pages/ShoewearPage.tsx": "Marketplace-style page for browsing shoes and NFTs with search, filters, categories, and view modes.",
  "frontend/src/pages/WalletPage.tsx": "Displays user wallet details and owned NFTs, loading NFT images dynamically and linking to the NFT portal.",
  "frontend/src/types/aframe-jsx.d.ts": "Type definitions enabling JSX support for A-Frame custom HTML elements.",
  "frontend/src/types/aframe-runtime.d.ts": "Declares global AFRAME presence on the window object for runtime typing.",
  "frontend/src/types/avatar.ts": "Type definitions and constants for avatar configuration including skin, face, hair, and body options.",
  "frontend/src/types/avatarCloset.ts": "Wardrobe types for avatar closet items and equipped looks, with defaults.",
  "frontend/src/types/creatorSlots.ts": "Types for creator content slots including status, metadata, analytics, and capacity tracking.",
  "frontend/src/types/vrSpaceBuilder.ts": "Types for building VR spaces, defining scenes, objects, rules, environment, and published space data.",
  "frontend/src/utils/avatarClosetStorage.ts": "LocalStorage helpers for saving, loading, and clearing equipped avatar wardrobe looks.",
  "frontend/src/utils/avatarConfigStorage.ts": "LocalStorage utilities for avatar configuration persistence with validation and defaults.",
  "frontend/src/utils/creatorSlotsStorage.ts": "LocalStorage helper for loading, saving, updating, and deleting creator slots with capacity tracking.",
  "frontend/src/utils/generateAvatarGLB.ts": "Builds a rigged anime-style avatar in Three.js, including skeleton, mesh, materials, and animations.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL params, persisting them in sessionStorage, and cleaning hash parameters.",
  "frontend/src/utils/vrSpaceStorage.ts": "Manages VR space drafts and published spaces using localStorage with CRUD operations.",
  "frontend/src/xr/nuverseAvatarAssets.ts": "Defines static asset paths and clip-name helpers for the NuVerse avatar’s GLB model and animations.",
  "frontend/src/xr/nuverseEquippedItemMapping.ts": "Maps equipped item IDs to XR equipment assets, bone attachment metadata, and helper accessors.",
  "frontend/src/xr/registerAFrameAttachmentComponents.ts": "Registers an A‑Frame component that attaches equipment models to avatar bones with fallback resolution.",
  "frontend/src/xr/registerAFrameXrComponents.ts": "Registers an A‑Frame animation controller component to manage avatar stances and animation playback.",
  "frontend/src/xr/xrAttachmentTargets.ts": "Defines XR attachment categories and a registry mapping targets to primary and fallback bones, plus helper lookup utilities.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radius, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project's current feature set, versions, and high-level system summary for a React + ICP app."
}